MCarvajal99/PIC18F4550/Matrix LED 8x8 CC/Matri_8x8_CC.X/Main.c
/*
 * File:   Main.c
 * Author: marco
 *
 * Created on 16 de junio de 2021, 09:46 PM
 */


// PIC18F4550 Configuration Bit Settings

// CONFIG1L
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config USBDIV = 1       // USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1) (USB clock source comes directly from the primary oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator (HS))
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOR = ON         // Brown-out Reset Enable bits (Brown-out Reset enabled in hardware only (SBOREN is disabled))
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF         // Single-Supply ICSP Enable bit (Single-Supply ICSP enabled)
#pragma config ICPRT = OFF      // Dedicated In-Circuit Debug/Programming Port (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-001FFFh) is not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (002000-003FFFh) is not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (004000-005FFFh) is not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (006000-007FFFh) is not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) is not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM is not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) is not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) is not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) is not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) are not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) is not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM is not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) is not protected from table reads executed in other blocks)

#define _XTAL_FREQ 8000000
#include <xc.h>
#include "matrix_8x8_cc.h"

void main(void) {
    
    TRISD = 0x00;
    TRISB = 0x00;
    LATD = 0x00;
    LATB = 0x00;
    
    while (1)
    {
        write_A (100);
        write_B (100);
        write_C (100);
        write_D (100);
        write_E (100);
        write_F (100);
        write_G (100);
        write_H (100);
        write_I (100);
        write_J (100);
        write_K (100);
        write_L (100);
        write_M (100);
        write_N (100);
        write_eneC (100);
        write_O (100);
        write_P (100);
        write_Q (100);
        write_R (100);
        write_S(100);
        write_T(100);
        write_U(100);
        write_V(100);
        write_W(100);
        write_X(100);
        write_Y(100);
        write_Z(100);
        write_0(100);
        write_1(100);
        write_2(100);
        write_3(100);
        write_4(100);
        write_5(100);
        write_6(100);
        write_7(100);
        write_8(100);
        write_9(100);
        write_a(100);
        write_b(100);
        write_c(100);
        write_d(100);
        write_e(100);
        write_f(100);
        write_g(100);
        write_h(100);
        write_i(100);
        write_j(100);
        write_k(100);
        write_l(100);
        write_m(100);
        write_n(100);
        write_eneM(100);
        write_o(100);
        write_p(100);
        write_q(100);
        write_r(100);
        write_s(100);
        write_t(100);
        write_u(100);
        write_v(100);
        write_w(100);
        write_x(100);
        write_y(100);
        write_z(100);
        write_qmarkup(100);
        write_qmarkud(100);
        write_prts(100);
        write_prtleft(100);
        write_prtright(100);
        write_stkman(100);
        write_smile(100);
        write_sad(100);
        write_fill(100);
        write_emarkd(100);
        write_emarku(100);
        write_point(100);
        write_prte(100);
        write_numeral(100);
        write_mosaic(100);
        write_arrowu(100);
        write_arrowr(100);
        write_arrowd(100);
        write_arrowl(100);
    }
    
    return;
}
